app/views/dojos/show_dojo.html.erb

SELECT "students".* FROM "students" WHERE "students"."dojo_id" = ?  [["dojo_id", 1]]
---
	</tr>
	<% @dojo.students.each do |student| %>