app/controllers/dojos_controller.rb

SELECT "dojos".* FROM "dojos"
---
  def index
  	@dojos = Dojo.all

DELETE FROM "dojos" WHERE "dojos"."id" = ?  [["id", 5]]
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
  	@dojo = Dojo.find(params[:id]).destroy

INSERT INTO "dojos" ("branch", "street", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["branch", "CD CD CD CD CD"], ["street", "asdffdasdf"], ["city", "asdfasf"], ["state", "NY"], ["created_at", "2017-10-09 20:53:40.990885"], ["updated_at", "2017-10-09 20:53:40.990885"]]
---
  def create
  	dojo = Dojo.new(dojo_params)
  	dojo.save

SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "dojos" SET "street" = ?, "city" = ?, "state" = ?, "updated_at" = ? WHERE "dojos"."id" = ?  [["street", "110 Leland Ave"], ["city", "San Francisco"], ["state", "CA"], ["updated_at", "2017-10-09 20:14:43.680256"], ["id", 6]]
---
  def update
  	@dojo = Dojo.find(params[:id])
  	@dojo.update(dojo_params)

SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 1]]
---
  def show_edit_page
  	@dojo = Dojo.find(params[:id])