app/controllers/students_controller.rb

SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 1]]
---
   def index
    @dojo = Dojo.find(params[:id])

INSERT INTO "students" ("first_name", "last_name", "email", "dojo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Cat "], ["last_name", "Jennings"], ["email", "c@c.com"], ["dojo_id", 1], ["created_at", "2017-10-10 02:45:59.367459"], ["updated_at", "2017-10-10 02:45:59.367459"]]
---
  def create
    s = Student.new(student_params)
    s.save

SELECT "dojos".* FROM "dojos"
---
  def new
    @dojos = Dojo.all

SELECT "students".* FROM "students" WHERE ("students"."created_at" BETWEEN '2017-10-09 04:17:48.028990' AND '2017-10-09 22:23:24.726940')
SELECT "students".* FROM "students" WHERE "students"."dojo_id" = ? AND (created_at >'2017-10-09 00:00:00.000000' ) AND ("students"."id" != ?)  [["dojo_id", 1], ["id", 1]]
---
  def show
    @student = Student.find(params[:id])
    cohort_date = @student.created_at

    @classmates = Student.where(dojo_id: params[:dojo_id]).where("created_at >? ",cohort_date.beginning_of_day).where.not(id: params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 24]]
SELECT "dojos".* FROM "dojos"
---
  def edit
    @student = Student.find(params[:id])
    @dojos = Dojo.all

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 24]]
UPDATE "students" SET "email" = ?, "dojo_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["email", "c@c.com"], ["dojo_id", 1], ["updated_at", "2017-10-10 04:47:38.995132"], ["id", 43]]
---
  def update
      @student = Student.find(params[:id])
      @student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 46]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 46]]
---
  def destroy
    @student = Student.find(params[:id])
    dojo_id = @student.dojo_id
    @student.destroy